Revit 2027 API
WireTypeSet Class
A set that contains wire types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireTypeSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireTypeSet : APIObject,
	IEnumerable
Public Class WireTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class WireTypeSet : public APIObject,
	IEnumerable
type WireTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The WireTypeSet type exposes the following members.
Constructors
Name | Description
WireTypeSet | Initializes a new instance of the WireTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of wire types that are in the set.
Top
Methods
Name | Description
Clear | Removes every wire type from the set, rendering it empty.
Contains | Tests for the existence of a wire type within the set.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase | Removes a specified wire type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert | Insert the specified wire type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace